[Demo_Tutorial_ActionEvent_Shinobu_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=0,Y=0,Z=0),SecTime=)
DemoScripts[2]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[3]=(Actor=TUT_TEXTURE,Command=START,CId=3,Bit=0)
DemoScripts[4]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Ekoro.GG2_BGM_DM_Usual_Ekoro_Cue')
DemoScripts[5]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[6]=(Actor=FADE,Command=WAIT)
DemoScripts[7]=(Actor=WINDOW,Command=SET)
DemoScripts[8]=(Actor=SYSTEM,Command=TAG,Label=JUMP01)
DemoScripts[9]=(Actor=TUT_TEXTURE,Command=SET,CId=1,Bit=1)
DemoScripts[10]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[13]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=2,Bit=2)
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[19]=(Actor=TUT_TEXTURE,Command=CROSS_FADE,CId=3,Bit=3)
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[24]=(Actor=SELECT,Command=SET,ID=SELECT00)
DemoScripts[25]=(Actor=SYSTEM,Command=TAG,Label=JUMP02)
DemoScripts[26]=(Actor=WINDOW,Command=EXIT)
DemoScripts[27]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[28]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[29]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[30]=(Actor=SYSTEM,Command=END)

[Select_Tutorial_ActionEvent_Shinobu_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=2,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Tutorial_ActionEvent_Shinobu_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="忍大人的屁股......不妙了!/n放鬆忍大人的身體/n幫助她脫離窗戶吧!")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="找到只有在視點範圍內纔看得見的目標/n並進行射擊,好像能讓忍大人的/n滿足度上升的樣子.")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="因為有時間限制,/n所以盡快找出目標/n進行處理是重點.")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="如果滿足度量值下面出現對話框,/n就代表在對話框出現的期間/n某處出現了要求圖示.")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="請以忍大人的聲音為線索/n找出要求圖示,照著圖示描繪的動作/n操作ZR鍵和R操控搖桿.")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="ZR鍵代表用手指觸碰,R操控搖桿/n則是反映手指的動作.按住ZR鍵的同時/n推動R操控搖桿就會變成\"摩擦\".")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="只要畫面中有顯示要求圖示,/nZR鍵+R操控搖桿的操作/n就會是有效的,敬請放心.")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="要是能完成她的要求,/n就可以獲得更多滿足度!/n請千萬別錯過了.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="在滿足度到達MAX或時間限制結束時,/n會短暫出現身體接觸環節.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="在這個環節中,/n請不停重複指示的操作!/n如此一來量值就會不斷向上累積.")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="這裡的量值增加多寡/n會受到在此之前的滿足度高低影響./n兩邊都不能輕忽大意呢.")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="以上的流程重複3次後就結束了./n請好好加油,拯救忍大人的屁股吧!")

Texts[12]=(Label="",Name="",Text="")

Texts[13]=(Label="SELECT01",Name="",Text="重來一次")

Texts[14]=(Label="SELECT02",Name="",Text="沒問題了")

Texts[15]=(Label="SELECT03",Name="",Text="")

Texts[16]=(Label="SELECT04",Name="",Text="")

Texts[17]=(Label="SELECT05",Name="",Text="")

Texts[18]=(Label="SELECT06",Name="",Text="")

Texts[19]=(Label="SELECT07",Name="",Text="")

Texts[20]=(Label="SELECT08",Name="",Text="")

Texts[21]=(Label="SELECT09",Name="",Text="")

Texts[22]=(Label="SELECT10",Name="",Text="")


